benchmark_results/Knative-4C-4gb/test-logs.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: script-knative.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 1m0s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 017/500 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 017/500 VUs  0m01.0s/1m00.0s

running (0m02.0s), 033/500 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 033/500 VUs  0m02.0s/1m00.0s

running (0m03.0s), 050/500 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 050/500 VUs  0m03.0s/1m00.0s

running (0m04.0s), 067/500 VUs, 25 complete and 0 interrupted iterations
default   [   7% ] 067/500 VUs  0m04.0s/1m00.0s

running (0m05.0s), 083/500 VUs, 86 complete and 0 interrupted iterations
default   [   8% ] 083/500 VUs  0m05.0s/1m00.0s

running (0m06.0s), 100/500 VUs, 168 complete and 0 interrupted iterations
default   [  10% ] 100/500 VUs  0m06.0s/1m00.0s

running (0m07.0s), 117/500 VUs, 258 complete and 0 interrupted iterations
default   [  12% ] 117/500 VUs  0m07.0s/1m00.0s

running (0m08.0s), 133/500 VUs, 374 complete and 0 interrupted iterations
default   [  13% ] 133/500 VUs  0m08.0s/1m00.0s

running (0m09.0s), 150/500 VUs, 504 complete and 0 interrupted iterations
default   [  15% ] 150/500 VUs  0m09.0s/1m00.0s

running (0m10.0s), 166/500 VUs, 652 complete and 0 interrupted iterations
default   [  17% ] 166/500 VUs  0m10.0s/1m00.0s

running (0m11.0s), 183/500 VUs, 771 complete and 0 interrupted iterations
default   [  18% ] 183/500 VUs  0m11.0s/1m00.0s

running (0m12.0s), 200/500 VUs, 936 complete and 0 interrupted iterations
default   [  20% ] 200/500 VUs  0m12.0s/1m00.0s

running (0m13.0s), 216/500 VUs, 1068 complete and 0 interrupted iterations
default   [  22% ] 216/500 VUs  0m13.0s/1m00.0s

running (0m14.0s), 233/500 VUs, 1272 complete and 0 interrupted iterations
default   [  23% ] 233/500 VUs  0m14.0s/1m00.0s

running (0m15.0s), 250/500 VUs, 1505 complete and 0 interrupted iterations
default   [  25% ] 250/500 VUs  0m15.0s/1m00.0s

running (0m16.0s), 266/500 VUs, 1754 complete and 0 interrupted iterations
default   [  27% ] 266/500 VUs  0m16.0s/1m00.0s

running (0m17.0s), 283/500 VUs, 2020 complete and 0 interrupted iterations
default   [  28% ] 283/500 VUs  0m17.0s/1m00.0s

running (0m18.0s), 300/500 VUs, 2141 complete and 0 interrupted iterations
default   [  30% ] 300/500 VUs  0m18.0s/1m00.0s

running (0m19.0s), 316/500 VUs, 2428 complete and 0 interrupted iterations
default   [  32% ] 316/500 VUs  0m19.0s/1m00.0s

running (0m20.0s), 333/500 VUs, 2744 complete and 0 interrupted iterations
default   [  33% ] 333/500 VUs  0m20.0s/1m00.0s

running (0m21.0s), 349/500 VUs, 3077 complete and 0 interrupted iterations
default   [  35% ] 349/500 VUs  0m21.0s/1m00.0s

running (0m22.0s), 366/500 VUs, 3203 complete and 0 interrupted iterations
default   [  37% ] 366/500 VUs  0m22.0s/1m00.0s

running (0m23.0s), 383/500 VUs, 3445 complete and 0 interrupted iterations
default   [  38% ] 383/500 VUs  0m23.0s/1m00.0s

running (0m24.0s), 399/500 VUs, 3818 complete and 0 interrupted iterations
default   [  40% ] 399/500 VUs  0m24.0s/1m00.0s

running (0m25.0s), 416/500 VUs, 3990 complete and 0 interrupted iterations
default   [  42% ] 416/500 VUs  0m25.0s/1m00.0s

running (0m26.0s), 433/500 VUs, 4406 complete and 0 interrupted iterations
default   [  43% ] 433/500 VUs  0m26.0s/1m00.0s

running (0m27.0s), 449/500 VUs, 4644 complete and 0 interrupted iterations
default   [  45% ] 449/500 VUs  0m27.0s/1m00.0s

running (0m28.0s), 466/500 VUs, 4841 complete and 0 interrupted iterations
default   [  47% ] 466/500 VUs  0m28.0s/1m00.0s

running (0m29.0s), 482/500 VUs, 5090 complete and 0 interrupted iterations
default   [  48% ] 482/500 VUs  0m29.0s/1m00.0s

running (0m30.0s), 499/500 VUs, 5465 complete and 0 interrupted iterations
default   [  50% ] 499/500 VUs  0m30.0s/1m00.0s

running (0m31.0s), 495/500 VUs, 5818 complete and 0 interrupted iterations
default   [  52% ] 495/500 VUs  0m31.0s/1m00.0s

running (0m32.0s), 490/500 VUs, 5962 complete and 0 interrupted iterations
default   [  53% ] 490/500 VUs  0m32.0s/1m00.0s

running (0m33.0s), 475/500 VUs, 6163 complete and 0 interrupted iterations
default   [  55% ] 475/500 VUs  0m33.0s/1m00.0s

running (0m34.0s), 459/500 VUs, 6331 complete and 0 interrupted iterations
default   [  57% ] 459/500 VUs  0m34.0s/1m00.0s

running (0m35.0s), 424/500 VUs, 6772 complete and 0 interrupted iterations
default   [  58% ] 424/500 VUs  0m35.0s/1m00.0s

running (0m36.0s), 418/500 VUs, 6938 complete and 0 interrupted iterations
default   [  60% ] 418/500 VUs  0m36.0s/1m00.0s

running (0m37.0s), 392/500 VUs, 7356 complete and 0 interrupted iterations
default   [  62% ] 392/500 VUs  0m37.0s/1m00.0s

running (0m38.0s), 385/500 VUs, 7528 complete and 0 interrupted iterations
default   [  63% ] 385/500 VUs  0m38.0s/1m00.0s

running (0m39.0s), 365/500 VUs, 7782 complete and 0 interrupted iterations
default   [  65% ] 365/500 VUs  0m39.0s/1m00.0s

running (0m40.0s), 351/500 VUs, 7975 complete and 0 interrupted iterations
default   [  67% ] 351/500 VUs  0m40.0s/1m00.0s

running (0m41.0s), 334/500 VUs, 8209 complete and 0 interrupted iterations
default   [  68% ] 334/500 VUs  0m41.0s/1m00.0s

running (0m42.0s), 313/500 VUs, 8543 complete and 0 interrupted iterations
default   [  70% ] 313/500 VUs  0m42.0s/1m00.0s

running (0m43.0s), 290/500 VUs, 8840 complete and 0 interrupted iterations
default   [  72% ] 290/500 VUs  0m43.0s/1m00.0s

running (0m44.0s), 279/500 VUs, 9084 complete and 0 interrupted iterations
default   [  73% ] 279/500 VUs  0m44.0s/1m00.0s

running (0m45.0s), 258/500 VUs, 9342 complete and 0 interrupted iterations
default   [  75% ] 258/500 VUs  0m45.0s/1m00.0s

running (0m46.0s), 253/500 VUs, 9422 complete and 0 interrupted iterations
default   [  77% ] 253/500 VUs  0m46.0s/1m00.0s

running (0m47.0s), 225/500 VUs, 9668 complete and 0 interrupted iterations
default   [  78% ] 225/500 VUs  0m47.0s/1m00.0s

running (0m48.0s), 214/500 VUs, 9805 complete and 0 interrupted iterations
default   [  80% ] 214/500 VUs  0m48.0s/1m00.0s

running (0m49.0s), 192/500 VUs, 10018 complete and 0 interrupted iterations
default   [  82% ] 192/500 VUs  0m49.0s/1m00.0s

running (0m50.0s), 180/500 VUs, 10113 complete and 0 interrupted iterations
default   [  83% ] 180/500 VUs  0m50.0s/1m00.0s

running (0m51.0s), 161/500 VUs, 10262 complete and 0 interrupted iterations
default   [  85% ] 161/500 VUs  0m51.0s/1m00.0s

running (0m52.0s), 142/500 VUs, 10422 complete and 0 interrupted iterations
default   [  87% ] 142/500 VUs  0m52.0s/1m00.0s

running (0m53.0s), 128/500 VUs, 10526 complete and 0 interrupted iterations
default   [  88% ] 128/500 VUs  0m53.0s/1m00.0s

running (0m54.0s), 107/500 VUs, 10653 complete and 0 interrupted iterations
default   [  90% ] 107/500 VUs  0m54.0s/1m00.0s

running (0m55.0s), 096/500 VUs, 10723 complete and 0 interrupted iterations
default   [  92% ] 096/500 VUs  0m55.0s/1m00.0s

running (0m56.0s), 077/500 VUs, 10816 complete and 0 interrupted iterations
default   [  93% ] 077/500 VUs  0m56.0s/1m00.0s

running (0m57.0s), 062/500 VUs, 10893 complete and 0 interrupted iterations
default   [  95% ] 062/500 VUs  0m57.0s/1m00.0s

running (0m58.0s), 044/500 VUs, 10953 complete and 0 interrupted iterations
default   [  97% ] 044/500 VUs  0m58.0s/1m00.0s

running (0m59.0s), 027/500 VUs, 10997 complete and 0 interrupted iterations
default   [  98% ] 027/500 VUs  0m59.0s/1m00.0s

running (1m00.0s), 012/500 VUs, 11024 complete and 0 interrupted iterations
default   [ 100% ] 012/500 VUs  1m00.0s/1m00.0s

     data_received..................: 2.0 MB 33 kB/s
     data_sent......................: 1.0 MB 17 kB/s
     http_req_blocked...............: avg=3.04ms   min=663ns  med=2.1µs    max=549.96ms p(90)=3.87µs   p(95)=13.81µs
     http_req_connecting............: avg=3.04ms   min=0s     med=0s       max=549.91ms p(90)=0s       p(95)=0s     
     http_req_duration..............: avg=388.8ms  min=2.26ms med=248.14ms max=3.12s    p(90)=944.28ms p(95)=1.13s  
       { expected_response:true }...: avg=388.8ms  min=2.26ms med=248.14ms max=3.12s    p(90)=944.28ms p(95)=1.13s  
     http_req_failed................: 0.00%  0 out of 11036
     http_req_receiving.............: avg=25.02µs  min=4.69µs med=20.97µs  max=1.06ms   p(90)=42.83µs  p(95)=51.63µs
     http_req_sending...............: avg=7.47µs   min=1.43µs med=5µs      max=1.52ms   p(90)=11.69µs  p(95)=23.08µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s       p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=388.77ms min=2.2ms  med=248.1ms  max=3.12s    p(90)=944.25ms p(95)=1.13s  
     http_reqs......................: 11036  181.768843/s
     iteration_duration.............: avg=1.39s    min=1s     med=1.25s    max=4.13s    p(90)=1.95s    p(95)=2.14s  
     iterations.....................: 11036  181.768843/s
     vus............................: 12     min=12         max=499
     vus_max........................: 500    min=500        max=500


running (1m00.7s), 000/500 VUs, 11036 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/500 VUs  1m0s